{"config": [{"config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null, "name": "conv2d_1", "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "filters": 75, "padding": "valid", "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "name": "dropout_1", "dtype": "float32", "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "padding": "valid", "kernel_constraint": null, "name": "conv2d_2", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "filters": 100, "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "name": "dropout_2", "dtype": "float32", "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 500, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_3", "dtype": "float32", "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 10, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "activation": "softmax", "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.4-tf", "class_name": "Sequential"}